Ran Plan for project: `staging` dir: `etc/terraform/environments` workspace: `staging`

<details><summary>Show Output</summary>

```diff
Initializing modules...
Downloading git::git@github.com:holaluz/kraken.git for alb...
- alb in .terraform/modules/alb/aws/ec2/alb
- alb.aws_variables in .terraform/modules/alb/aws/variables
Downloading git::git@github.com:holaluz/kraken.git for aws_variables...
- aws_variables in .terraform/modules/aws_variables/aws/variables
Downloading git::git@github.com:holaluz/kraken.git for basic_dashboard...
- basic_dashboard in .terraform/modules/basic_dashboard/datadog/dashboards
- basic_dashboard.alb_monitor in .terraform/modules/basic_dashboard/datadog/monitors/alb
- basic_dashboard.alb_monitor.alb_4XX_monitor in .terraform/modules/basic_dashboard/datadog/monitors/alb/4XX
- basic_dashboard.alb_monitor.alb_4XX_monitor.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.alb_monitor.alb_5XX_monitor in .terraform/modules/basic_dashboard/datadog/monitors/alb/5XX
- basic_dashboard.alb_monitor.alb_5XX_monitor.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.alb_monitor.alb_latency_monitor in .terraform/modules/basic_dashboard/datadog/monitors/alb/latency
- basic_dashboard.alb_monitor.alb_latency_monitor.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.alb_monitor.alb_request_count_monitor in .terraform/modules/basic_dashboard/datadog/monitors/alb/request_count
- basic_dashboard.alb_monitor.alb_request_count_monitor.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.ec2_monitor_asg_api in .terraform/modules/basic_dashboard/datadog/monitors/ec2
- basic_dashboard.ec2_monitor_asg_api.cpu in .terraform/modules/basic_dashboard/datadog/monitors/ec2/cpu
- basic_dashboard.ec2_monitor_asg_api.cpu.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.ec2_monitor_asg_api.disk in .terraform/modules/basic_dashboard/datadog/monitors/ec2/disk
- basic_dashboard.ec2_monitor_asg_api.disk.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.ec2_monitor_asg_crons in .terraform/modules/basic_dashboard/datadog/monitors/ec2
- basic_dashboard.ec2_monitor_asg_crons.cpu in .terraform/modules/basic_dashboard/datadog/monitors/ec2/cpu
- basic_dashboard.ec2_monitor_asg_crons.cpu.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.ec2_monitor_asg_crons.disk in .terraform/modules/basic_dashboard/datadog/monitors/ec2/disk
- basic_dashboard.ec2_monitor_asg_crons.disk.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.rds_monitors in .terraform/modules/basic_dashboard/datadog/monitors/rds
- basic_dashboard.rds_monitors.cpu_usage in .terraform/modules/basic_dashboard/datadog/monitors/rds/cpu_usage
- basic_dashboard.rds_monitors.cpu_usage.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.rds_monitors.free_space_remaining in .terraform/modules/basic_dashboard/datadog/monitors/rds/free_space_remaining
- basic_dashboard.rds_monitors.free_space_remaining.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.rds_monitors.replica_lag in .terraform/modules/basic_dashboard/datadog/monitors/rds/replica_lag
- basic_dashboard.rds_monitors.replica_lag.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.supervisor_monitor_crons in .terraform/modules/basic_dashboard/datadog/monitors/supervisor
- basic_dashboard.supervisor_monitor_crons.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
Downloading git::git@github.com:holaluz/kraken.git for ecs_application...
- ecs_application in .terraform/modules/ecs_application/aws/ecs/ecs_cluster_single_service
- ecs_application.ecr in .terraform/modules/ecs_application/aws/ecr
- ecs_application.ecs_cluster in .terraform/modules/ecs_application/aws/ecs/ecs_cluster
- ecs_application.ecs_service in .terraform/modules/ecs_application/aws/ecs/ecs_service
- ecs_application.ecs_service.aws_variables in .terraform/modules/ecs_application/aws/variables
- ecs_application.ecs_service.cloudwatch_log_group in .terraform/modules/ecs_application/aws/cloudwatch/log_group
- ecs_application.ecs_task in .terraform/modules/ecs_application/aws/ecs/ecs_task
- ecs_application.ecs_task.iam_policy_to_access_needed_secrets in .terraform/modules/ecs_application/aws/iam/policy_secrets
- ecs_application.ecs_task.iam_policy_to_access_needed_secrets.aws_variables in .terraform/modules/ecs_application/aws/variables

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding datadog/datadog versions matching "~> 3.1"...
- Finding hashicorp/template versions matching "~> 2.1"...
- Finding hashicorp/aws versions matching ">= 4.9.0, ~> 4.9"...
- Installing hashicorp/template v2.2.0...
- Installed hashicorp/template v2.2.0 (signed by HashiCorp)
- Installing hashicorp/aws v4.48.0...
- Installed hashicorp/aws v4.48.0 (signed by HashiCorp)
- Installing datadog/datadog v3.18.0...
- Installed datadog/datadog v3.18.0 (signed by a HashiCorp partner, key ID FB70BE941301C3EA)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Switched to workspace "staging".

Downloading git::git@github.com:holaluz/kraken.git for alb...
- alb in .terraform/modules/alb/aws/ec2/alb
- alb.aws_variables in .terraform/modules/alb/aws/variables
Downloading git::git@github.com:holaluz/kraken.git for aws_variables...
- aws_variables in .terraform/modules/aws_variables/aws/variables
Downloading git::git@github.com:holaluz/kraken.git for basic_dashboard...
- basic_dashboard in .terraform/modules/basic_dashboard/datadog/dashboards
- basic_dashboard.alb_monitor in .terraform/modules/basic_dashboard/datadog/monitors/alb
- basic_dashboard.alb_monitor.alb_4XX_monitor in .terraform/modules/basic_dashboard/datadog/monitors/alb/4XX
- basic_dashboard.alb_monitor.alb_4XX_monitor.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.alb_monitor.alb_5XX_monitor in .terraform/modules/basic_dashboard/datadog/monitors/alb/5XX
- basic_dashboard.alb_monitor.alb_5XX_monitor.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.alb_monitor.alb_latency_monitor in .terraform/modules/basic_dashboard/datadog/monitors/alb/latency
- basic_dashboard.alb_monitor.alb_latency_monitor.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.alb_monitor.alb_request_count_monitor in .terraform/modules/basic_dashboard/datadog/monitors/alb/request_count
- basic_dashboard.alb_monitor.alb_request_count_monitor.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.ec2_monitor_asg_api in .terraform/modules/basic_dashboard/datadog/monitors/ec2
- basic_dashboard.ec2_monitor_asg_api.cpu in .terraform/modules/basic_dashboard/datadog/monitors/ec2/cpu
- basic_dashboard.ec2_monitor_asg_api.cpu.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.ec2_monitor_asg_api.disk in .terraform/modules/basic_dashboard/datadog/monitors/ec2/disk
- basic_dashboard.ec2_monitor_asg_api.disk.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.ec2_monitor_asg_crons in .terraform/modules/basic_dashboard/datadog/monitors/ec2
- basic_dashboard.ec2_monitor_asg_crons.cpu in .terraform/modules/basic_dashboard/datadog/monitors/ec2/cpu
- basic_dashboard.ec2_monitor_asg_crons.cpu.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.ec2_monitor_asg_crons.disk in .terraform/modules/basic_dashboard/datadog/monitors/ec2/disk
- basic_dashboard.ec2_monitor_asg_crons.disk.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.rds_monitors in .terraform/modules/basic_dashboard/datadog/monitors/rds
- basic_dashboard.rds_monitors.cpu_usage in .terraform/modules/basic_dashboard/datadog/monitors/rds/cpu_usage
- basic_dashboard.rds_monitors.cpu_usage.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.rds_monitors.free_space_remaining in .terraform/modules/basic_dashboard/datadog/monitors/rds/free_space_remaining
- basic_dashboard.rds_monitors.free_space_remaining.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.rds_monitors.replica_lag in .terraform/modules/basic_dashboard/datadog/monitors/rds/replica_lag
- basic_dashboard.rds_monitors.replica_lag.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.supervisor_monitor_crons in .terraform/modules/basic_dashboard/datadog/monitors/supervisor
- basic_dashboard.supervisor_monitor_crons.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
Downloading git::git@github.com:holaluz/kraken.git for ecs_application...
- ecs_application in .terraform/modules/ecs_application/aws/ecs/ecs_cluster_single_service
- ecs_application.ecr in .terraform/modules/ecs_application/aws/ecr
- ecs_application.ecs_cluster in .terraform/modules/ecs_application/aws/ecs/ecs_cluster
- ecs_application.ecs_service in .terraform/modules/ecs_application/aws/ecs/ecs_service
- ecs_application.ecs_service.aws_variables in .terraform/modules/ecs_application/aws/variables
- ecs_application.ecs_service.cloudwatch_log_group in .terraform/modules/ecs_application/aws/cloudwatch/log_group
- ecs_application.ecs_task in .terraform/modules/ecs_application/aws/ecs/ecs_task
- ecs_application.ecs_task.iam_policy_to_access_needed_secrets in .terraform/modules/ecs_application/aws/iam/policy_secrets
- ecs_application.ecs_task.iam_policy_to_access_needed_secrets.aws_variables in .terraform/modules/ecs_application/aws/variables


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.alb.aws_lb.alb will be created
+ resource "aws_lb" "alb" {
+       arn                        = (known after apply)
+       arn_suffix                 = (known after apply)
+       desync_mitigation_mode     = "defensive"
+       dns_name                   = (known after apply)
+       drop_invalid_header_fields = true
+       enable_deletion_protection = false
+       enable_http2               = true
+       enable_waf_fail_open       = false
+       id                         = (known after apply)
+       idle_timeout               = 60
+       internal                   = true
+       ip_address_type            = (known after apply)
+       load_balancer_type         = "application"
+       name                       = "test-repo-jfi-staging-private"
+       preserve_host_header       = true
+       security_groups            = (known after apply)
+       subnets                    = [
+           "subnet-08178094b64355e92",
+           "subnet-0847317e984ba5111",
+           "subnet-0f7ee5b76673dadae",
        ]
+       tags                       = {
+           "Application" = "test-repo-jfi"
+           "Deployment"  = "terraform"
+           "Environment" = "staging"
+           "Monitored"   = "datadog"
+           "Name"        = "test-repo-jfi-staging-private-alb"
+           "Owner"       = "chufis"
+           "Resource"    = "alb-public"
+           "WAF"         = "disassociated"
        }
+       tags_all                   = {
+           "Application" = "test-repo-jfi"
+           "Deployment"  = "terraform"
+           "Environment" = "staging"
+           "Monitored"   = "datadog"
+           "Name"        = "test-repo-jfi-staging-private-alb"
+           "Owner"       = "chufis"
+           "Resource"    = "alb-public"
+           "WAF"         = "disassociated"
        }
+       vpc_id                     = (known after apply)
+       zone_id                    = (known after apply)

+       access_logs {
+           bucket  = "holaluz-logs"
+           enabled = true
+           prefix  = "alb/staging/internal/test-repo-jfi"
        }

+       subnet_mapping {
+           allocation_id        = (known after apply)
+           ipv6_address         = (known after apply)
+           outpost_id           = (known after apply)
+           private_ipv4_address = (known after apply)
+           subnet_id            = (known after apply)
        }
    }

  # module.alb.aws_lb_listener.no_ssl_redirect_to_ssl[0] will be created
+ resource "aws_lb_listener" "no_ssl_redirect_to_ssl" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       load_balancer_arn = (known after apply)
+       port              = 80
+       protocol          = "HTTP"
+       ssl_policy        = (known after apply)
+       tags_all          = (known after apply)

+       default_action {
+           order = (known after apply)
+           type  = "redirect"

+           redirect {
+               host        = "#{host}"
+               path        = "/#{path}"
+               port        = "443"
+               protocol    = "HTTPS"
+               query       = "#{query}"
+               status_code = "HTTP_301"
            }
        }
    }

  # module.alb.aws_lb_listener.with_ssl[0] will be created
+ resource "aws_lb_listener" "with_ssl" {
+       arn               = (known after apply)
+       certificate_arn   = "arn:aws:acm:eu-west-1:165908609791:certificate/67c667b2-d580-40a4-a1a2-a5737fb58f4a"
+       id                = (known after apply)
+       load_balancer_arn = (known after apply)
+       port              = 443
+       protocol          = "HTTPS"
+       ssl_policy        = "ELBSecurityPolicy-TLS-1-2-2017-01"
+       tags_all          = (known after apply)

+       default_action {
+           order            = (known after apply)
+           target_group_arn = (known after apply)
+           type             = "forward"
        }
    }

  # module.alb.aws_lb_target_group.alb will be created
+ resource "aws_lb_target_group" "alb" {
+       arn                                = (known after apply)
+       arn_suffix                         = (known after apply)
+       connection_termination             = false
+       deregistration_delay               = "300"
+       id                                 = (known after apply)
+       ip_address_type                    = (known after apply)
+       lambda_multi_value_headers_enabled = false
+       load_balancing_algorithm_type      = (known after apply)
+       name                               = "test-repo-jfi-staging-private"
+       port                               = 8080
+       preserve_client_ip                 = (known after apply)
+       protocol                           = "HTTP"
+       protocol_version                   = (known after apply)
+       proxy_protocol_v2                  = false
+       slow_start                         = 0
+       tags                               = {
+           "Application" = "test-repo-jfi"
+           "Deployment"  = "terraform"
+           "Environment" = "staging"
+           "Monitored"   = "datadog"
+           "Name"        = "test-repo-jfi-staging-private-alb"
+           "Owner"       = "chufis"
+           "Resource"    = "alb-public"
+           "WAF"         = "disassociated"
        }
+       tags_all                           = {
+           "Application" = "test-repo-jfi"
+           "Deployment"  = "terraform"
+           "Environment" = "staging"
+           "Monitored"   = "datadog"
+           "Name"        = "test-repo-jfi-staging-private-alb"
+           "Owner"       = "chufis"
+           "Resource"    = "alb-public"
+           "WAF"         = "disassociated"
        }
+       target_type                        = "ip"
+       vpc_id                             = "vpc-f504e990"

+       health_check {
+           enabled             = true
+           healthy_threshold   = 3
+           interval            = 30
+           matcher             = "200"
+           path                = "/health"
+           port                = "traffic-port"
+           protocol            = "HTTP"
+           timeout             = 10
+           unhealthy_threshold = 3
        }

+       stickiness {
+           cookie_duration = (known after apply)
+           cookie_name     = (known after apply)
+           enabled         = (known after apply)
+           type            = (known after apply)
        }

+       target_failover {
+           on_deregistration = (known after apply)
+           on_unhealthy      = (known after apply)
        }
    }

  # module.alb.aws_route53_record.alb[0] will be created
+ resource "aws_route53_record" "alb" {
+       allow_overwrite = (known after apply)
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = "test-repo-jfi.staging.clidom.es"
+       type            = "A"
+       zone_id         = "Z3VBSH4Z3N3V93"

+       alias {
+           evaluate_target_health = false
+           name                   = (known after apply)
+           zone_id                = (known after apply)
        }
    }

  # module.alb.aws_security_group.alb will be created
+ resource "aws_security_group" "alb" {
+       arn                    = (known after apply)
+       description            = "Security group for test-repo-jfi-staging ALB."
+       egress                 = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               description      = "All traffic allowed."
+               from_port        = 0
+               ipv6_cidr_blocks = [
+                   "::/0",
                ]
+               prefix_list_ids  = []
+               protocol         = "-1"
+               security_groups  = []
+               self             = false
+               to_port          = 0
            },
        ]
+       id                     = (known after apply)
+       ingress                = [
+           {
+               cidr_blocks      = [
+                   "172.31.0.0/16",
+                   "10.64.0.0/16",
                ]
+               description      = "Allow inbound traffic to ALB port 443"
+               from_port        = 443
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 443
            },
+           {
+               cidr_blocks      = [
+                   "172.31.0.0/16",
+                   "10.64.0.0/16",
                ]
+               description      = "Allow inbound traffic to ALB port 80"
+               from_port        = 80
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 80
            },
        ]
+       name                   = "test-repo-jfi-staging-private-alb"
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Application" = "test-repo-jfi"
+           "Deployment"  = "terraform"
+           "Environment" = "staging"
+           "Monitored"   = "datadog"
+           "Name"        = "test-repo-jfi-staging-private-alb"
+           "Owner"       = "chufis"
+           "Resource"    = "security-group"
+           "WAF"         = "disassociated"
        }
+       tags_all               = {
+           "Application" = "test-repo-jfi"
+           "Deployment"  = "terraform"
+           "Environment" = "staging"
+           "Monitored"   = "datadog"
+           "Name"        = "test-repo-jfi-staging-private-alb"
+           "Owner"       = "chufis"
+           "Resource"    = "security-group"
+           "WAF"         = "disassociated"
        }
+       vpc_id                 = "vpc-f504e990"
    }

  # module.ecs_application.aws_cloudwatch_log_stream.this will be created
+ resource "aws_cloudwatch_log_stream" "this" {
+       arn            = (known after apply)
+       id             = (known after apply)
+       log_group_name = "/ecs/service/test-repo-jfi-staging"
+       name           = "test-repo-jfi-staging"
    }

  # module.ecs_application.module.ecs_cluster.aws_ecs_cluster.this will be created
+ resource "aws_ecs_cluster" "this" {
+       arn                = (known after apply)
+       capacity_providers = (known after apply)
+       id                 = (known after apply)
+       name               = "test-repo-jfi-staging"
+       tags               = {
+           "Application" = "test-repo-jfi"
+           "Deployment"  = "terraform"
+           "Environment" = "staging"
+           "Monitored"   = "datadog"
+           "Name"        = "test-repo-jfi-staging"
+           "Owner"       = "chufis"
+           "Resource"    = "ecs-cluster"
        }
+       tags_all           = {
+           "Application" = "test-repo-jfi"
+           "Deployment"  = "terraform"
+           "Environment" = "staging"
+           "Monitored"   = "datadog"
+           "Name"        = "test-repo-jfi-staging"
+           "Owner"       = "chufis"
+           "Resource"    = "ecs-cluster"
        }

+       default_capacity_provider_strategy {
+           base              = (known after apply)
+           capacity_provider = (known after apply)
+           weight            = (known after apply)
        }

+       setting {
+           name  = "containerInsights"
+           value = "enabled"
        }
    }

  # module.ecs_application.module.ecs_cluster.aws_ecs_cluster_capacity_providers.this will be created
+ resource "aws_ecs_cluster_capacity_providers" "this" {
+       capacity_providers = [
+           "FARGATE",
+           "FARGATE_SPOT",
        ]
+       cluster_name       = "test-repo-jfi-staging"
+       id                 = (known after apply)

+       default_capacity_provider_strategy {
+           base              = 0
+           capacity_provider = "FARGATE_SPOT"
+           weight            = 0
        }
    }

  # module.ecs_application.module.ecs_service.aws_ecs_service.this will be created
+ resource "aws_ecs_service" "this" {
+       cluster                            = (known after apply)
+       deployment_maximum_percent         = 200
+       deployment_minimum_healthy_percent = 100
+       desired_count                      = 0
+       enable_ecs_managed_tags            = false
+       enable_execute_command             = false
+       health_check_grace_period_seconds  = (known after apply)
+       iam_role                           = (known after apply)
+       id                                 = (known after apply)
+       launch_type                        = "FARGATE"
+       name                               = "test-repo-jfi-staging"
+       platform_version                   = (known after apply)
+       scheduling_strategy                = "REPLICA"
+       tags                               = {
+           "Application" = "test-repo-jfi"
+           "Deployment"  = "terraform"
+           "Environment" = "staging"
+           "Monitored"   = "datadog"
+           "Name"        = "test-repo-jfi-staging"
+           "Owner"       = "chufis"
+           "Resource"    = "ecs-service"
        }
+       tags_all                           = {
+           "Application" = "test-repo-jfi"
+           "Deployment"  = "terraform"
+           "Environment" = "staging"
+           "Monitored"   = "datadog"
+           "Name"        = "test-repo-jfi-staging"
+           "Owner"       = "chufis"
+           "Resource"    = "ecs-service"
        }
+       task_definition                    = (known after apply)
+       triggers                           = (known after apply)
+       wait_for_steady_state              = false

+       deployment_circuit_breaker {
+           enable   = true
+           rollback = true
        }

+       load_balancer {
+           container_name   = (known after apply)
+           container_port   = (known after apply)
+           elb_name         = (known after apply)
+           target_group_arn = (known after apply)
        }

+       network_configuration {
+           assign_public_ip = true
+           security_groups  = (known after apply)
+           subnets          = [
+               "subnet-08178094b64355e92",
+               "subnet-0847317e984ba5111",
+               "subnet-0f7ee5b76673dadae",
            ]
        }
    }

  # module.ecs_application.module.ecs_service.aws_security_group.this will be created
+ resource "aws_security_group" "this" {
+       arn                    = (known after apply)
+       description            = "Security group for test-repo-jfi-staging in ECS."
+       egress                 = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               description      = "All traffic allowed."
+               from_port        = 0
+               ipv6_cidr_blocks = [
+                   "::/0",
                ]
+               prefix_list_ids  = []
+               protocol         = "-1"
+               security_groups  = []
+               self             = false
+               to_port          = 0
            },
        ]
+       id                     = (known after apply)
+       ingress                = [
+           {
+               cidr_blocks      = []
+               description      = (known after apply)
+               from_port        = (known after apply)
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = (known after apply)
+               security_groups  = (known after apply)
+               self             = false
+               to_port          = (known after apply)
            },
        ]
+       name                   = "test-repo-jfi-staging-ecs-service"
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Application" = "test-repo-jfi"
+           "Deployment"  = "terraform"
+           "Environment" = "staging"
+           "Monitored"   = "datadog"
+           "Name"        = "test-repo-jfi-staging-ecs-service"
+           "Owner"       = "chufis"
+           "Resource"    = "security-group"
        }
+       tags_all               = {
+           "Application" = "test-repo-jfi"
+           "Deployment"  = "terraform"
+           "Environment" = "staging"
+           "Monitored"   = "datadog"
+           "Name"        = "test-repo-jfi-staging-ecs-service"
+           "Owner"       = "chufis"
+           "Resource"    = "security-group"
        }
+       vpc_id                 = "vpc-f504e990"
    }

  # module.ecs_application.module.ecs_task.aws_ecs_task_definition.this will be created
+ resource "aws_ecs_task_definition" "this" {
+       arn                      = (known after apply)
+       container_definitions    = jsonencode(
            [
+               {
+                   command          = []
+                   cpu              = 0
+                   dockerLabels     = {
+                       com.datadoghq.tags.env     = "staging"
+                       com.datadoghq.tags.service = "test-repo-jfi"
                    }
+                   environment      = [
+                       {
+                           name  = "DD_ENV"
+                           value = "staging"
                        },
+                       {
+                           name  = "DD_LOGS_INJECTION"
+                           value = "true"
                        },
+                       {
+                           name  = "DD_PROFILING_ENABLED"
+                           value = "false"
                        },
+                       {
+                           name  = "DD_SERVICE"
+                           value = "test-repo-jfi"
                        },
+                       {
+                           name  = "DD_TRACE_SAMPLE_RATE"
+                           value = "1"
                        },
+                       {
+                           name  = "PROFILE"
+                           value = "staging"
                        },
                    ]
+                   essential        = true
+                   image            = "165908609791.dkr.ecr.eu-west-1.amazonaws.com/test-repo-jfi:staging"
+                   logConfiguration = {
+                       logDriver = "awsfirelens"
+                       options   = {
+                           Host           = "http-intake.logs.datadoghq.eu"
+                           Name           = "datadog"
+                           TLS            = "on"
+                           apiKey         = "6cc5160dc30036a7aada901c55476837"
+                           dd_message_key = "logs"
+                           dd_service     = "test-repo-jfi"
+                           dd_source      = "test-repo-jfi"
+                           dd_tags        = "env:staging"
+                           provider       = "ecs"
                        }
                    }
+                   mountPoints      = []
+                   name             = "test-repo-jfi-staging"
+                   portMappings     = [
+                       {
+                           containerPort = 8080
+                           hostPort      = 8080
+                           protocol      = "tcp"
                        },
                    ]
+                   secrets          = [
+                       {
+                           name      = "DD_API_KEY"
+                           valueFrom = "arn:aws:secretsmanager:eu-west-1:165908609791:secret:dd_api_key-ZmeHOo"
                        },
                    ]
+                   stopTimeout      = 30
+                   volumesFrom      = []
                },
+               {
+                   cpu              = 10
+                   environment      = [
+                       {
+                           name  = "DD_APM_ENABLED"
+                           value = "true"
                        },
+                       {
+                           name  = "DD_APM_NON_LOCAL_TRAFFIC"
+                           value = "true"
                        },
+                       {
+                           name  = "DD_SITE"
+                           value = "datadoghq.eu"
                        },
+                       {
+                           name  = "ECS_FARGATE"
+                           value = "true"
                        },
                    ]
+                   essential        = true
+                   image            = "public.ecr.aws/datadog/agent:latest"
+                   logConfiguration = {
+                       logDriver = "awslogs"
+                       options   = {
+                           awslogs-group         = "/ecs/service/test-repo-jfi-staging"
+                           awslogs-region        = "eu-west-1"
+                           awslogs-stream-prefix = "ecs"
                        }
                    }
+                   memory           = 256
+                   mountPoints      = []
+                   name             = "test-repo-jfi-staging-dd-agent"
+                   portMappings     = [
+                       {
+                           containerPort = 8126
+                           hostPort      = 8126
+                           protocol      = "tcp"
                        },
                    ]
+                   secrets          = [
+                       {
+                           name      = "DD_API_KEY"
+                           valueFrom = "arn:aws:secretsmanager:eu-west-1:165908609791:secret:dd_api_key-ZmeHOo"
                        },
                    ]
+                   stopTimeout      = 30
+                   volumesFrom      = []
                },
+               {
+                   cpu                   = 0
+                   environment           = []
+                   essential             = true
+                   firelensConfiguration = {
+                       options = {
+                           config-file-type        = "file"
+                           config-file-value       = "/fluent-bit/configs/parse-json.conf"
+                           enable-ecs-log-metadata = "true"
                        }
+                       type    = "fluentbit"
                    }
+                   image                 = "public.ecr.aws/aws-observability/aws-for-fluent-bit:stable"
+                   logConfiguration      = {
+                       logDriver = "awslogs"
+                       options   = {
+                           awslogs-group         = "/ecs/service/test-repo-jfi-staging"
+                           awslogs-region        = "eu-west-1"
+                           awslogs-stream-prefix = "ecs"
                        }
                    }
+                   mountPoints           = []
+                   name                  = "test-repo-jfi-staging-fluentbit"
+                   portMappings          = []
+                   stopTimeout           = 30
+                   user                  = "0"
+                   volumesFrom           = []
                },
            ]
        )
+       cpu                      = "1024"
+       execution_role_arn       = (known after apply)
+       family                   = "test-repo-jfi-staging"
+       id                       = (known after apply)
+       memory                   = "2048"
+       network_mode             = "awsvpc"
+       requires_compatibilities = [
+           "FARGATE",
        ]
+       revision                 = (known after apply)
+       skip_destroy             = false
+       tags                     = {
+           "Application" = "test-repo-jfi"
+           "Deployment"  = "terraform"
+           "Environment" = "staging"
+           "Monitored"   = "datadog"
+           "Name"        = "test-repo-jfi-staging"
+           "Owner"       = "chufis"
+           "Resource"    = "ecs-task-definition"
        }
+       tags_all                 = {
+           "Application" = "test-repo-jfi"
+           "Deployment"  = "terraform"
+           "Environment" = "staging"
+           "Monitored"   = "datadog"
+           "Name"        = "test-repo-jfi-staging"
+           "Owner"       = "chufis"
+           "Resource"    = "ecs-task-definition"
        }
+       task_role_arn            = (known after apply)
    }

  # module.ecs_application.module.ecs_task.aws_iam_role.task_role[0] will be created
+ resource "aws_iam_role" "task_role" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "ecs-tasks.amazonaws.com"
                        }
+                       Sid       = ""
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "ecs-execution-role-test-repo-jfi-staging"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags                  = {
+           "Application" = "test-repo-jfi"
+           "Deployment"  = "terraform"
+           "Environment" = "staging"
+           "Monitored"   = "datadog"
+           "Name"        = "ecs-task-test-repo-jfi-staging"
+           "Owner"       = "chufis"
        }
+       tags_all              = {
+           "Application" = "test-repo-jfi"
+           "Deployment"  = "terraform"
+           "Environment" = "staging"
+           "Monitored"   = "datadog"
+           "Name"        = "ecs-task-test-repo-jfi-staging"
+           "Owner"       = "chufis"
        }
+       unique_id             = (known after apply)

+       inline_policy {
+           name   = (known after apply)
+           policy = (known after apply)
        }
    }

  # module.ecs_application.module.ecs_task.aws_iam_role_policy_attachment.attach_execution_policy_to_role[0] will be created
+ resource "aws_iam_role_policy_attachment" "attach_execution_policy_to_role" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
+       role       = "ecs-execution-role-test-repo-jfi-staging"
    }

  # module.ecs_application.module.ecs_service.module.cloudwatch_log_group.aws_cloudwatch_log_group.this will be created
+ resource "aws_cloudwatch_log_group" "this" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       name              = "/ecs/service/test-repo-jfi-staging"
+       name_prefix       = (known after apply)
+       retention_in_days = 7
+       skip_destroy      = false
+       tags              = {
+           "Application" = "test-repo-jfi"
+           "Deployment"  = "terraform"
+           "Environment" = "staging"
+           "Monitored"   = "datadog"
+           "Name"        = "test-repo-jfi-staging"
+           "Owner"       = "chufis"
+           "Resource"    = "cloudwatch-log-group"
        }
+       tags_all          = {
+           "Application" = "test-repo-jfi"
+           "Deployment"  = "terraform"
+           "Environment" = "staging"
+           "Monitored"   = "datadog"
+           "Name"        = "test-repo-jfi-staging"
+           "Owner"       = "chufis"
+           "Resource"    = "cloudwatch-log-group"
        }
    }

  # module.ecs_application.module.ecs_task.module.iam_policy_to_access_needed_secrets[0].aws_iam_role_policy.this will be created
+ resource "aws_iam_role_policy" "this" {
+       id     = (known after apply)
+       name   = "test-repo-jfi-staging-secrets"
+       policy = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "secretsmanager:ListSecretVersionIds",
+                           "secretsmanager:GetSecretValue",
+                           "secretsmanager:GetResourcePolicy",
+                           "secretsmanager:DescribeSecret",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:secretsmanager:eu-west-1:165908609791:secret:test-repo-jfi-staging-application-*",
+                           "arn:aws:secretsmanager:eu-west-1:165908609791:secret:dd_api_key-ZmeHOo",
                        ]
+                       Sid      = ""
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       role   = (known after apply)
    }

Plan: 16 to add, 0 to change, 0 to destroy.
╷
│ Warning: Argument is deprecated
│ 
│   with module.basic_dashboard.module.supervisor_monitor_crons.module.this.datadog_monitor.this,
│   on .terraform/modules/basic_dashboard/datadog/monitors/monitor/monitor.tf line 3, in resource "datadog_monitor" "this":
│    3:   locked              = false
│ 
│ Use `restricted_roles`.
│ 
│ (and 11 more similar warnings elsewhere)
╵

  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
  0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0100   171  100    16  100   155    126   1220 --:--:-- --:--:-- --:--:--  1357
{"status": "ok"}

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p staging`
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p staging`
</details>
Plan: 16 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
